In [1]:
import pandas as pd
import numpy as np
from ast import literal_eval

In [19]:
df = pd.read_csv('./data/raw_data_marathon.csv', na_values=['NC'], index_col=0)
df.head()

,name,bib_number,half_1st,half_second,time_total_netto,time_total_brutto,5km,10km,15km,20km,25km,30km,35km,40km
0,"DURAND, Yohan",1,01:37:38,02:02:11,03:39:49,04:00:19,00:23:03,00:45:41,01:08:12,01:32:26,01:59:49,02:31:33,03:01:20,03:28:04
1,"LUIS, Vincent",2,–,–,–,–,–,–,–,–,–,–,–,–
2,NaN,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
names = df['name'].str.split(', ', expand=True)
df['last_name'] = names.iloc[:,0]
df['first_name'] = names.iloc[:,1]
df.drop(columns='name', inplace=True)
df.head()

,bib_number,half_1st,half_second,time_total_netto,time_total_brutto,5km,10km,15km,20km,25km,30km,35km,40km,last_name,first_name
0,1,01:37:38,02:02:11,03:39:49,04:00:19,00:23:03,00:45:41,01:08:12,01:32:26,01:59:49,02:31:33,03:01:20,03:28:04,DURAND,Yohan
1,2,–,–,–,–,–,–,–,–,–,–,–,–,LUIS,Vincent
2,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df.dtypes

bib_number            int64
half_1st             object
half_second          object
time_total_netto     object
time_total_brutto    object
5km                  object
10km                 object
15km                 object
20km                 object
25km                 object
30km                 object
35km                 object
40km                 object
last_name            object
first_name           object
dtype: object

In [5]:
df.isna().sum()
print(f"{df.isna().sum()['last_name']} dossards n'ont pas été attribués et vont être retirés de ce dataframe.")

1558 dossards n'ont pas été attribués et vont être retirés de ce dataframe.

In [6]:
df = df.dropna()
print(f"{df.isna().sum()['last_name']} : pour vérification")

0 : pour vérification

In [7]:
sorted_df = df.sort_values(by="time_total_netto").reset_index()
sorted_df.drop(columns='index', inplace=True)

In [8]:
sorted_df.head()

,bib_number,half_1st,half_second,time_total_netto,time_total_brutto,5km,10km,15km,20km,25km,30km,35km,40km,last_name,first_name
0,8,01:11:17,01:13:25,02:24:41,02:24:43,00:16:35,00:33:02,00:49:34,01:07:26,01:24:27,01:42:37,01:59:26,02:16:58,WARD,Jared
1,2802,01:12:41,01:14:47,02:27:28,02:27:29,00:16:53,00:33:43,00:50:45,01:08:51,01:25:45,01:44:22,02:01:21,02:19:29,GIZYNSKI,Mariusz
2,616,01:12:44,01:17:20,02:30:04,02:30:06,00:16:24,00:33:02,00:49:34,01:08:44,01:26:15,01:45:41,02:03:04,02:21:58,BADIER,Mathieu
3,62,01:14:20,01:15:45,02:30:04,02:30:06,00:16:52,00:34:02,00:51:39,01:10:22,01:27:41,01:46:17,02:03:20,02:21:58,ADAM,Guillaume
4,298,01:15:42,01:18:31,02:34:13,02:34:13,00:17:00,00:34:24,00:52:28,01:11:47,01:29:31,01:48:49,02:07:36,02:26:22,MONTAUDON,Luc

In [9]:
sorted_df.tail()

,bib_number,half_1st,half_second,time_total_netto,time_total_brutto,5km,10km,15km,20km,25km,30km,35km,40km,last_name,first_name
19436,9219,–,–,–,–,–,–,–,–,–,–,–,–,SAILLANT,Violaine
19437,9218,–,–,–,–,–,–,–,–,–,–,–,–,PINEAU,Elodie
19438,9217,–,–,–,–,–,–,–,–,–,–,–,–,VOILLEMIER,Mylene
19439,9310,–,–,–,–,–,–,–,–,–,–,–,–,MAO,Dorian
19440,15651,–,–,–,–,–,–,–,–,–,–,–,–,SHAIMERDENOVA,Dina

In [10]:
sorted_df.shape

(19441, 15)

In [11]:
print(f" Dossard maximal distribué : {np.max(sorted_df['bib_number'])} < 21000 analysés = ok pour le scrapping")

 Dossard maximal distribué : 20474 < 21000 analysés = ok pour le scrapping

In [12]:
sorted_df['last_name'] = sorted_df['last_name'].apply(lambda row : row[0] + '.')
sorted_df['first_name'] = sorted_df['first_name'].apply(lambda row : row[0] + '.')

In [15]:
sorted_df.tail()

,bib_number,half_1st,half_second,time_total_netto,time_total_brutto,5km,10km,15km,20km,25km,30km,35km,40km,last_name,first_name
19436,9219,–,–,–,–,–,–,–,–,–,–,–,–,S.,V.
19437,9218,–,–,–,–,–,–,–,–,–,–,–,–,P.,E.
19438,9217,–,–,–,–,–,–,–,–,–,–,–,–,V.,M.
19439,9310,–,–,–,–,–,–,–,–,–,–,–,–,M.,D.
19440,15651,–,–,–,–,–,–,–,–,–,–,–,–,S.,D.

In [13]:
sorted_df.to_csv('.data/cleaned_data_marathon_all_participants.csv')

In [14]:
sorted_df.loc[19440, "half_1st"]

'–'